# Ex. 4.6 Reading practise

In [1]:
#Iporting Limbraries 
import pandas as pd
import numpy as np
import os

In [2]:
#creating path to data folder
path = r'C:\Users\mojos\OneDrive\Career Foundry Course\Task4 - InstaCart Project\02 Data'

In [3]:
df_orders_prior = pd.read_csv(os.path.join(path,'Raw Data','orders_products_prior.csv'),index_col=False)

In [4]:
df_ords = pd.read_csv(os.path.join(path,'Prepared Data','orders_checked.csv'),index_col=0)

In [5]:
#Checking output of new Orders Prior dataframe and original Ords dataframe

df_orders_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,prior,1,2,8,NaN,First Order
1,1,2398795,1,prior,2,3,7,15.0,Repeat Customer
2,2,473747,1,prior,3,3,12,21.0,Repeat Customer
3,3,2254736,1,prior,4,4,7,29.0,Repeat Customer
4,4,431534,1,prior,5,4,15,28.0,Repeat Customer

In [7]:
#Additional Unnamed column not required, not deleted from original orders prepared file - dropping now before completing the merge

df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [8]:
df_orders_prior.shape

(32434489, 4)

In [9]:
df_ords.shape

(3421083, 8)

In [10]:
#performing the merge using order_id as the Key
df_merged_large = df_ords.merge(df_orders_prior, on = 'order_id', indicator = True)

In [11]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

#remember, because the merge defaulted to 'inner' due to not specifying the join type, it ONLY included values where both table keys were present. CF recommends also performing an outer join, to show the FULL data set followed by an additional value.counts() to see where any additional mismatches/blanks exist.

In [12]:
df_merged_large.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,prior,1,2,8,NaN,First Order,196,1,0,both
1,2539329,1,prior,1,2,8,NaN,First Order,14084,2,0,both
2,2539329,1,prior,1,2,8,NaN,First Order,12427,3,0,both
3,2539329,1,prior,1,2,8,NaN,First Order,26088,4,0,both
4,2539329,1,prior,1,2,8,NaN,First Order,26405,5,0,both

In [13]:
#Exporting to Pickle - .pkl files make exporting large files faster and they retain their python/jupyter structure.

df_merged_large.to_pickle(os.path.join(path, 'Prepared Data', 'orders_products_combined.pkl'))

In [15]:
df_merged_large.shape

(32434489, 12)

In [16]:
df_merged_large.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,prior,1,2,8,NaN,First Order,196,1,0,both
1,2539329,1,prior,1,2,8,NaN,First Order,14084,2,0,both
2,2539329,1,prior,1,2,8,NaN,First Order,12427,3,0,both
3,2539329,1,prior,1,2,8,NaN,First Order,26088,4,0,both
4,2539329,1,prior,1,2,8,NaN,First Order,26405,5,0,both